[
    [
        {
            "productCode": "22178P28",
            "title": "Full Day Hiking Tour at Mt.Takao including Hot Spring",
            "description": "Mt. Takao is the most popular climbing spot in the Kanto area, located about 50 kilometers west of the city center. It is a wonderful mountain, designated as Michelin three star spot along with Mt. Fuji in 2007, and it’s a national park where you can leisurely enjoy mountain hiking even on a day trip. The mountain has been especially important to Japanese since 744, when Emperor Shomu commanded the creation of Yakushiji, a famous temple, and thereby encouraged followers to come to the mountain. Known as one of Tokyo's best outlooks, the view from the observation deck is of a big panorama overlooking the Kanto Plain, with skyscrapers in the distance. Leave the hustle and bustle of the city for a rejuvinating day where you'll connect with nature in a spiritual setting.",
            "productUrl": "https://www.viator.com/tours/Tokyo/Full-Day-Hike-Tour-at-Mr-Takao-including-Hot-Spring-in-Tokyo/d334-22178P28?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
            "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0f/9d/5c/51.jpg",
            "duration": 330,
            "lengthType": "Full Day",
            "rating": 5.0,
            "price": 125.41,
            "availableOnDate": [
                {
                    "2023-07-22": [
                        "09:00"
                    ]
                },
                {
                    "2023-07-23": [
                        "09:00"
                    ]
                }
            ],
            "startTime": "09:00",
            "dateSelected": "2023-07-22",
            "endTime": "14:30"
        },
        {
            "productCode": "407792P2",
            "title": "DAIKOKU PA Tokyo Drift CAR MEET",
            "description": "With Gaijin Tuned, you will be fully immersed in Japanese car culture. In addition to visiting various car meeting points, not just visiting Daikoku Parking futo. Let's visit the biggest automotive shop in Japan, we can interact with Japanese drivers and have the experience of getting into the car you've always dreamed of. We will also visit the most beautiful spots in Tokyo such as: Tokyo tower, Tokyo Skytree, Raibow Bridge, Shinjuku, akihabara and Shibuya. So this tour is not just for car enthusiasts but also for your friend who is not really into cars but wants to know more about Tokyo.I can pick up you and drop off you at hotel.",
            "productUrl": "https://www.viator.com/tours/Tokyo/DAIKOKU-JDM-CULTURE-CAR-MEET-Tokyo-Tour/d334-407792P2?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
            "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/10/7f/97/24.jpg",
            "duration": 360,
            "lengthType": "Full Day",
            "rating": 5.0,
            "price": 147.55,
            "availableOnDate": [
                {
                    "2023-07-22": [
                        "18:00",
                        "10:00"
                    ]
                },
                {
                    "2023-07-23": [
                        "18:00",
                        "10:00"
                    ]
                }
            ],
            "startTime": "18:00",
            "dateSelected": "2023-07-22",
            "endTime": "00:00"
        }
    ],
    [
        {
            "productCode": "89977P1",
            "title": "Sangenjaya Back Alleys Private Food and Drink Tour",
            "description": "•Private, fully inclusive and customizable experience.\n•Explore the narrow lantern lit back alleys of funky Sangenjaya, a central neighbourhood not often visited by tourists. \n• Try traditional foods such as kushikatsu, charcoal grilled meat, sashimi and much more.\n• Cook your own okonomiyaki or monjayaki in a local institution.\n• Visit three off the beaten track izakayas specially selected by your guide. \n• Meet the locals in a tiny but raucous kushikatsu standing bar.\n• Try unusual Japanese drinks such as Hoppy, shochu and sake.\n• Experience Tokyo's real nightlife away from the tourist crowds.\n• Eat and drink what you like.\n• Flexible start times.\n",
            "productUrl": "https://www.viator.com/tours/Tokyo/Tokyo-Food-Tour-Sangenjaya-Back-Allies-Izakaya-Experience/d334-89977P1?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
            "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/06/95/4e/ee.jpg",
            "duration": 240,
            "lengthType": "Half Day",
            "rating": 5.0,
            "price": 221.17,
            "availableOnDate": [
                "Nothing Found",
                {
                    "2023-07-23": [
                        "18:30"
                    ]
                }
            ],
            "GPT_RATING": 4.3,
            "startTime": "18:30",
            "dateSelected": "2023-07-23",
            "endTime": "22:30"
        }
    ]
]