[
    [
        {
            "productCode": "74127P3",
            "title": "Hidden Stairways of San Francisco",
            "description": "Please note: this walk is not at all strenuous. Obviously there's some stairs but this is done at a leisurely pace and suitable for almost everyone.\n\nThis breathtaking 2 mile walking tour of San Francisco's hidden stairways is the #1 rated Airbnb Experience in the Bay Area. See gorgeous mosaic tiled steps and hear the stories behind them, then take in stunning 360° views of the Golden Gate Bridge, Golden Gate Park and downtown San Francisco. You'll also discover beautiful neighborhoods and gardens that tourists rarely see...you might even go home with a succulent!\nI'll provide commentary, context and some history along the way.\n\nGenerally SF is dry May-October. There can be fog in the summertime, mostly in the morning. Temps rarely above 70F (21C) or below 50F (10C). Rain may cancel.\n\nInstagram account to see more photos: @hiddenstairssf #hiddenstairssf\n\nMessage me if you have questions!",
            "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/Hidden-Stairways-of-San-Francisco/d651-74127P3?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
            "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0e/ab/90/a8.jpg",
            "duration": 120,
            "lengthType": "Part Day",
            "rating": 5.0,
            "price": 33.0,
            "availableOnDate": [
                {
                    "2023-07-22": [
                        "13:00"
                    ]
                },
                {
                    "2023-07-23": [
                        "13:00"
                    ]
                },
                {
                    "2023-07-24": [
                        "10:30",
                        "13:00"
                    ]
                }
            ],
            "GPT_RATING": 4.9,
            "startTime": "13:00",
            "dateSelected": "2023-07-22",
            "endTime": "15:00"
        },
        {
            "productCode": "88280P1",
            "title": "San Francisco Ghost Hunt Walking Tour",
            "description": "Take a lantern-lit walk through one of San Francisco's oldest neighborhoods and see its most famous haunted places. You will walk one mile on tree-lined streets in a safe residential area with fine Victorian architecture. There is one moderate hill, the pace is easy, and the views are spectacular. You'll enjoy 90 minutes to 2 hours of history and fun! Highlights include: Poltergeists at the Chambers Mansion, the corpse in a barrel of rum at the Atherton Mansion, the ghost bride of California Street, the powerful woman who supported the Underground Railroad in San Francisco, and more. Your guide: Christian Cagigal is a Bay Area native and a lecturer of haunted history. He's performed across the globe as a magician and storyteller, and is a featured performer at the famous Magic Castle in Hollywood. Christian has won awards and accolades for his shows that have played across the U.S., Canada, and the U.K.",
            "productUrl": "https://shop.live.rc.viator.com/tours/x/y/d0-88280P1?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
            "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/09/96/b1/69.jpg",
            "duration": 120,
            "lengthType": "Part Day",
            "rating": 4.992908,
            "price": 0.0,
            "availableOnDate": [
                {
                    "2023-07-22": [
                        "20:00"
                    ]
                },
                {
                    "2023-07-23": [
                        "20:00"
                    ]
                },
                "Nothing Found"
            ],
            "startTime": "20:00",
            "dateSelected": "2023-07-22",
            "endTime": "22:00"
        }
    ],
    [
        {
            "productCode": "276666P4",
            "title": "2-Hour Private San Francisco City Tour in Open-air Convertible Jeep",
            "description": "See the San Francisco sights you want to see in an open-air convertible Jeep, at a pace that suits your group. \n\nThis 2-hour exploration includes a photo stop and ride over the Golden Gate Bridge and covers most of the city's must see highlights. Also on the route is a drive down Lombard Street (depending on traffic) Guests can choose to venture out to Golden Gate Park and Ocean Beach OR enjoy additional stops including Chinatown, City Hall, or a enjoy a spectacular bay view from Coit Tower on top of Telegraph Hill.\n\nNOTE: Price is per jeep, NOT per person. Our Jeeps fit up to 4 adults and 2 children. The 3rd row seating is perfect for children and teens.\n",
            "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/2-Hour-Private-San-Francisco-City-Tour-by-Convertable-Jeep/d651-276666P4?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
            "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/10/19/7c/74.jpg",
            "duration": 120,
            "lengthType": "Part Day",
            "rating": 5.0,
            "price": 360.0,
            "availableOnDate": [
                {
                    "2023-07-22": [
                        "13:00",
                        "09:00"
                    ]
                },
                {
                    "2023-07-23": [
                        "13:00",
                        "09:00"
                    ]
                },
                {
                    "2023-07-24": [
                        "13:00",
                        "09:00"
                    ]
                }
            ],
            "GPT_RATING": 4.9,
            "startTime": "09:00",
            "dateSelected": "2023-07-23",
            "endTime": "11:00"
        },
        {
            "productCode": "134227P3",
            "title": "Private 2 Hour San Francisco City Tuk Tuk Tour w/ Your Own Guide",
            "description": "See the San Francisco sights you want to see and see them at a pace that suits your group. Your friends and family can cover more ground in an eco-friendly Tuk Tuk than they ever could on foot. Climb San Francisco’s tallest hills in this small but mighty vehicle! Marvel at the sparkling San Francisco Bay and city skyline, and enjoy the sights and smells of Fisherman’s Wharf. Your experienced, entertaining tour guide narrates your 2-hour excursion, stopping often for Instagram-worthy photos!\n\nYour personal tour guide meets you at the starting location at Umbrella Allley in Fisherman's Wharf. \n\nPrivate tours are perfect for five riders per Tuk Tuk (6 guests are ok with a group that includes children and adults). Larger groups can rent multiple Tuk Tuks to cruise around together. \n",
            "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/Private-Lucky-Tuk-Tuk-3-Hour-Ultimate-San-Francisco-City-Tour/d651-134227P3?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
            "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/07/95/d8/7c.jpg",
            "duration": 120,
            "lengthType": "Part Day",
            "rating": 5.0,
            "price": 320.0,
            "availableOnDate": [
                {
                    "2023-07-22": [
                        "09:00"
                    ]
                },
                {
                    "2023-07-23": [
                        "13:00",
                        "09:00"
                    ]
                },
                {
                    "2023-07-24": [
                        "13:00",
                        "09:00"
                    ]
                }
            ],
            "GPT_RATING": 4.9,
            "startTime": "13:00",
            "dateSelected": "2023-07-23",
            "endTime": "15:00"
        }
    ],
    [
        {
            "productCode": "10700P3",
            "title": "Muir Woods, Sausalito and Tiburon Day Trip from San Francisco",
            "description": "Cross the Golden Gate to Muir Woods, Sausalito, and Tiburon on this 4-hour customizable tour with your own private guide. See why visitors from around the globe come to pay homage in this redwood cathedral, where some trees reach up to 250 feet (76 meters). Then choose how much time you'd like to spend in each waterfront town with their abundance of boutiques, cafes, restaurants. Pricing is per group, based on a maximum of six people.",
            "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/Muir-Woods-Sausalito-Tiburon-from-San-Francisco/d651-10700P3?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
            "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/06/6a/d3/87.jpg",
            "duration": 240,
            "lengthType": "Half Day",
            "rating": 5.0,
            "price": 114.0,
            "availableOnDate": [
                "Nothing Found",
                {
                    "2023-07-23": [
                        "08:00",
                        "13:00"
                    ]
                },
                {
                    "2023-07-24": [
                        "08:00",
                        "13:00"
                    ]
                }
            ],
            "GPT_RATING": 4.9,
            "startTime": "08:00",
            "dateSelected": "2023-07-24",
            "endTime": "12:00"
        },
        {
            "productCode": "322630P1",
            "title": "Take a Walk with a Storyteller! The Surreal San Francisco Tour.",
            "description": "- Explore the city with San Francisco's most hilarious, imaginative and EXCITING storyteller!\n\n- Get to know these three famous neighborhoods: the Mission, the Castro and the Haight. \n\n- Enjoy original FOLKLORE and FAIRYTALES told by Clyde Always: a professional storyteller, published poet and decade-long resident of the City by the Bay. Hear about witches & pirates, hobos & hipster devils. Bring your imagination!\n\n- Get insider knowledge of the best restaurants, bars, coffeehouses, parks, shops and more. See beautiful street-art, landmarks and architecture. Experience the City like a local.\n\n- BEWARE! Some of the information presented will be highly UNBELIEVABLE. Have fun sorting the fact from the fiction.\n\n-A 2.2 mile (3.5 km) walk with no hills. One public restroom along the way.\n\n- Please note: this tour is NOT for the whole family. Script includes profanity and you might see a nudist or two.\n\n- Guaranteed to entertain, enliven and uplift. An experience you'll always remember.\n\n",
            "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/The-Real-San-Francisco-Walking-Tour/d651-322630P1?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
            "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0c/0d/ef/fc.jpg",
            "duration": 120,
            "lengthType": "Part Day",
            "rating": 5.0,
            "price": 28.0,
            "availableOnDate": [
                {
                    "2023-07-22": [
                        "14:00",
                        "10:00"
                    ]
                },
                "Nothing Found",
                {
                    "2023-07-24": [
                        "14:00",
                        "10:00"
                    ]
                }
            ],
            "GPT_RATING": 3.0,
            "startTime": "14:00",
            "dateSelected": "2023-07-24",
            "endTime": "16:00"
        }
    ]
]