[
    {
        "productCode": "43028P8",
        "title": "Trou-aux-Cerfs - Chamarel - Grand Bassin -Private Guided Tour (Min. 2 persons)",
        "description": "Discover the lush inland parts of Mauritius and take in some majestic scenery. Check out the view from the top of a dormant volcano before breathing in the natural and spiritual beauty of a sacred lake. Next, you will admire the wild rolling landscape of the Black River Gorges National Park. Then head further south-west to capture the various wonders of Chamarel. An introduction to the secrets of rum-making will make this tour complete.\nHighlights of the day :\n• View point of Trou aux Cerfs, a dormant volcano • Connect with spirituality and natural beauty of Grand Bassin • Discover the wonders of the hinterland and wildlife of Mauritius with the Black River Gorges • Visit of Rhum making Distillery • Visit of Chamarel Coloured Earth & Waterfall",
        "productUrl": "https://www.viator.com/tours/Grand-Baie/Trou-aux-Cerfs-Black-River-Gorges-Rhumerie-de-Chamarel-Private-from-Curepipe/d23971-43028P8?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/06/6c/42/18.jpg",
        "duration": 480,
        "lengthType": "Full Day",
        "rating": 5.0,
        "price": 177.87,
        "availableOnDate": [
            {
                "2023-07-22": [
                    "09:00"
                ]
            },
            "Nothing Found"
        ]
    },
    {
        "productCode": "67217P19",
        "title": "Ile aux 2 Cocos Full Day on All Inclusive with complimentary activities ",
        "description": "Savour the island beauty on a day trip. Laze on the beach! Swim in clear waters! Snorkel in the marine park! Participate in inland games! Stroll along the small paths through native woodland! Enjoy our BBQ buffet! Taste our selection of local rums and unlimited drinks! Return Boat Transfers Island Signature Cocktail A Sumptuous Lunch Buffet Unlimited Local Drinks (Still & Sparkling water, Soft Drinks, Fruit juice, Local Beer, House Wine, Local Spirits, Cocktails) Island Activities Homemade Rum Selection I s l a n d A c t i v i t i e s Snorkelling or Glass Bottom Archery Giant Chess Bocce Ball Beach Volley Frisbee Badminton Boot Camp\n\nNote This Trip is available on Every Tuesday ,Thursday and Saturday for any booking \n\n.",
        "productUrl": "https://www.viator.com/tours/Balaclava/Sightseeing-Tours/d50694-67217P19?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/06/96/5f/b3.jpg",
        "duration": 420,
        "lengthType": "Full Day",
        "rating": 5.0,
        "price": 228.22,
        "availableOnDate": [
            "Nothing Found",
            "Nothing Found"
        ]
    },
    {
        "productCode": "175658P1",
        "title": "Scooters and bicycles for rent",
        "description": "A ride by scooter or bicycle to Mauritius is a way to keep a close with the Mauritian culture.A Mauritius is the most popular means of transport because it is a simple way, and It's also a good idea to go to the beach or even to the market without worrying about parking spaces that are too small for a car. Our bike rides are both informative and relaxing because, thanks to our guide, you will have an understanding of the places you have visited. as well as the opportunity to admire the landscape of the east coast of the island.",
        "productUrl": "https://www.viator.com/tours/Mauritius/Scooters-and-bicycles-for-rent/d4463-175658P1?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/07/bb/1e/18.jpg",
        "duration": 300,
        "lengthType": "Full Day",
        "rating": 5.0,
        "price": 43.9,
        "availableOnDate": [
            "Nothing Found",
            "Nothing Found"
        ]
    },
    {
        "productCode": "228581P2",
        "title": "Unique Sight Seeing Tours",
        "description": "This tour offers you to discover and explore the beautiful south west of Mauritius.\n\nTransport will be offered, pick up is included for this trip. I will come to pick you at your location. \nThe starting point is at Floréal, where you will visit the ship models factory. \n\nVolcano Trou aux Cerfs – Mauritius famous crater. From Floreal heading to Curepipe, you will stop on the way to visit the Trou aux Cerfs (a huge natural volcanic crater). \nGrand Bassin -Hindu Temple\n\nAlexandra falls - As part of this tour you will also drive through the Black River Gorges Nature Park, where you will see many endangered species of plants and animals and viewpoint. \n\nVisit of Chamarel Waterfall and Chamarel seven (7) colored earth. The village of Chamarel in southwest Mauritius is home to two natural wonders - the magnificent Chamarel waterfall and the seven colored earth of Chamarel. The seven colored earth is one of the wonders of Mauritius and is considered one of the must places to see.",
        "productUrl": "https://www.viator.com/tours/Mauritius/Unique-Sight-Seeing-Tours/d4463-228581P2?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/09/f5/ba/b7.jpg",
        "duration": 540,
        "lengthType": "Full Day",
        "rating": 5.0,
        "price": 197.63,
        "availableOnDate": [
            "Nothing Found",
            "Nothing Found"
        ]
    },
    {
        "productCode": "43028P17",
        "title": "Discover the heart of the Capital-Port Louis Private Guided Tour (Min.2 persons)",
        "description": "From the landing place of indentured Indian immigrants in Mauritius, the UNESCO-listed Aapravasi Ghat to the Central Market for a taste of our street food and a visit of Chinatown, past and present intertwine with history unfolding at every corner.\n",
        "productUrl": "https://www.viator.com/tours/Grand-Baie/A-walk-back-in-time-Guided-private-tour/d23971-43028P17?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/06/6c/42/08.jpg",
        "duration": 480,
        "lengthType": "Full Day",
        "rating": 5.0,
        "price": 108.12,
        "availableOnDate": [
            "Nothing Found",
            "Nothing Found"
        ]
    },
    {
        "productCode": "67217P40",
        "title": "Full Day Private Car at La Vallee des Couleurs Nature Park ",
        "description": "Get to know authentic Mauritian Fusion Cuisine at La Vallée des Couleurs through a visit at La Citronelle Restaurant. After strolling around the park, meet Chef Ganessen and his team of cooks and let them surprise you with their exotic dishes.You’re sure to have an adrenaline pumping, heart-pounding adventure in the paradise island of Mauritius. Conquer your fear of heights in a safe way, breath in the fresh air while you’ll walk along the longest suspended bridge in the Indian Ocean, 350 meters of pure joy. What a rewarding experience it is to reach the other end of the bridge. Enjoy the unique panoramic view of the south of the island like nowhere else. Immense yourself in nature and admire the indigenous fauna and flora, mountains, lakes, valleys, waterfalls and Multi-colored Earth – a fascinating natural wonder.",
        "productUrl": "https://www.viator.com/tours/Balaclava/Full-Day-Safari-Tour-at-La-Vallee-des-Couleurs-Nature-Park/d50694-67217P40?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0a/07/f4/f2.jpg",
        "duration": 360,
        "lengthType": "Full Day",
        "rating": 5.0,
        "price": 125.52,
        "availableOnDate": [
            {
                "2023-07-22": [
                    "09:00"
                ]
            },
            {
                "2023-07-23": [
                    "09:00"
                ]
            }
        ]
    },
    {
        "productCode": "45135P18",
        "title": "Full Day Guided Tea Route Mauritius: Including Lunch",
        "description": "Get ready to discover the process of tea manufacturing, with a guide you will learn about the harvested tea leaves and the tea factory whilst understanding the different steps of production. You may then continue with a tea tasting in the chalet, 'Le chalet du Domaine de Bois Chéri' overlooking the domaine and 'Le lac des Cygnes du Domaine de Bois Chéri', a truly unmissable experience! The lake is surrounded by the first tea plantations with tea plants of at least 125 years old.  \n\nYou will then learn about the process of sugar manufacturing which will be explained by your guide with the opportunity of tasting local rums by the first producer of agricultural rums made of sugarcane juice in Mauritius. A local lunch will be served on the veranda of 'Saint Aubin' a colonial house turned into a restaurant with a magnificent garden view. Also part of your visit is 'La Vanille Réserve des Mascareignes' park with unforgettable walks among rare reptiles and endemic plants.",
        "productUrl": "https://www.viator.com/tours/Grand-Baie/Full-Day-Guided-Tea-Route-Mauritius-Including-Lunch/d23971-45135P18?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/07/36/c7/c9.jpg",
        "duration": 300,
        "lengthType": "Full Day",
        "rating": 5.0,
        "price": 143.0,
        "availableOnDate": [
            "Nothing Found",
            "Nothing Found"
        ]
    },
    {
        "productCode": "139861P1",
        "title": "Discover Scuba Diving Experience",
        "description": "Blue World Explorer is a new, dynamic and innovating scuba diving service provider which has been set up to let all scuba divers discover the beauty of underwater life all around the paradise Island of Mauritius.\n\nwe offer tailor scuba diving services always taking into account safety and security at sea.\n\nall our dive centers are PADI Certified.\n\nyou can be anywhere in Mauritius and Rodrigues Blue World Explorer is always available to offer our scuba diving and nautical services.",
        "productUrl": "https://www.viator.com/tours/Mauritius/Discover-Scuba-Diving-Experience/d4463-139861P1?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/07/72/0b/3f.jpg",
        "duration": 120,
        "lengthType": "Part Day",
        "rating": 5.0,
        "price": 120.0,
        "availableOnDate": [
            {
                "2023-07-22": [
                    "12:30",
                    "09:30"
                ]
            },
            {
                "2023-07-23": [
                    "12:30",
                    "09:30"
                ]
            }
        ]
    },
    {
        "productCode": "204329P12",
        "title": "Private Airport Transfer Mauritius",
        "description": "-We provide, good car and amazing driver that will help you to load your luggage till arriving to destination\n\n-Arriving day,driver will wait for you in the arrival hall inside the airport with your name written on a signboard.\n\n-This activity consists of an airport to hotel or apartment transfer or vice versa.\n\n-Transfer will be private ",
        "productUrl": "https://www.viator.com/tours/Grand-Baie/Private-Airport-Transfer/d23971-204329P12?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0a/a9/19/d2.jpg",
        "duration": 60,
        "lengthType": "Part Day",
        "rating": 5.0,
        "price": 52.0,
        "availableOnDate": [
            "Nothing Found",
            "Nothing Found"
        ]
    }
]