[
    {
        "productCode": "74127P3",
        "title": "Hidden Stairways of San Francisco",
        "description": "Please note: this walk is not at all strenuous. Obviously there's some stairs but this is done at a leisurely pace and suitable for almost everyone.\n\nThis breathtaking 2 mile walking tour of San Francisco's hidden stairways is the #1 rated Airbnb Experience in the Bay Area. See gorgeous mosaic tiled steps and hear the stories behind them, then take in stunning 360° views of the Golden Gate Bridge, Golden Gate Park and downtown San Francisco. You'll also discover beautiful neighborhoods and gardens that tourists rarely see...you might even go home with a succulent!\nI'll provide commentary, context and some history along the way.\n\nGenerally SF is dry May-October. There can be fog in the summertime, mostly in the morning. Temps rarely above 70F (21C) or below 50F (10C). Rain may cancel.\n\nInstagram account to see more photos: @hiddenstairssf #hiddenstairssf\n\nMessage me if you have questions!",
        "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/Hidden-Stairways-of-San-Francisco/d651-74127P3?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0e/ab/90/a8.jpg"
    },
    {
        "productCode": "322630P1",
        "title": "Take a Walk with a Storyteller! The Surreal San Francisco Tour.",
        "description": "- Explore the city with San Francisco's most hilarious, imaginative and EXCITING storyteller!\n\n- Get to know these three famous neighborhoods: the Mission, the Castro and the Haight. \n\n- Enjoy original FOLKLORE and FAIRYTALES told by Clyde Always: a professional storyteller, published poet and decade-long resident of the City by the Bay. Hear about witches & pirates, hobos & hipster devils. Bring your imagination!\n\n- Get insider knowledge of the best restaurants, bars, coffeehouses, parks, shops and more. See beautiful street-art, landmarks and architecture. Experience the City like a local.\n\n- BEWARE! Some of the information presented will be highly UNBELIEVABLE. Have fun sorting the fact from the fiction.\n\n-A 2.2 mile (3.5 km) walk with no hills. One public restroom along the way.\n\n- Please note: this tour is NOT for the whole family. Script includes profanity and you might see a nudist or two.\n\n- Guaranteed to entertain, enliven and uplift. An experience you'll always remember.\n\n",
        "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/The-Real-San-Francisco-Walking-Tour/d651-322630P1?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0c/0d/ef/fc.jpg"
    },
    {
        "productCode": "64535P2",
        "title": "San Francisco Sunset Photography Tour",
        "description": "Capture treasured memories and photographs from a San Francisco Photo Tour with Doc Miles. Sunrise and Sunset tours take photographers to locations that provide the best perspectives to capture amazing photographs of Bay Area icons and scenery. Locations along the tours take the photographer to places that are not on any tour bus, but provide extraordinary views of the city and its landmarks.",
        "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/San-Francisco-Sunset-Photography-Tour/d651-64535P2?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/06/88/ce/f7.jpg"
    },
    {
        "productCode": "134682P2",
        "title": "Classic Sidecar Tour of San Francisco",
        "description": "We offer you a unique way of touring that few have experience, seeing the world with the distinctive twist of Sidecar. \n\nEveryone love sidecar, so be prepare to trade smiles and waves with complete strangers.\n\nWhen you take a tour in a tour bus you take pictures of people, but when you tour a classic sidecar motorcycle, people take pictures of you.",
        "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/Rides-by-me/d651-134682P2?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/07/73/d3/24.jpg"
    },
    {
        "productCode": "276666P4",
        "title": "2-Hour Private San Francisco City Tour in Open-air Convertible Jeep",
        "description": "See the San Francisco sights you want to see in an open-air convertible Jeep, at a pace that suits your group. \n\nThis 2-hour exploration includes a photo stop and ride over the Golden Gate Bridge and covers most of the city's must see highlights. Also on the route is a drive down Lombard Street (depending on traffic) Guests can choose to venture out to Golden Gate Park and Ocean Beach OR enjoy additional stops including Chinatown, City Hall, or a enjoy a spectacular bay view from Coit Tower on top of Telegraph Hill.\n\nNOTE: Price is per jeep, NOT per person. Our Jeeps fit up to 4 adults and 2 children. The 3rd row seating is perfect for children and teens.\n",
        "productUrl": "https://shop.live.rc.viator.com/tours/San-Francisco/2-Hour-Private-San-Francisco-City-Tour-by-Convertable-Jeep/d651-276666P4?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/10/19/7c/74.jpg"
    }
]