{
    "products": [
        {
            "product_0": {
                "product_code": "343488P1",
                "title": "Gander Walking Tours in Glasgow",
                "description": "Go for a gander on a tour which reflects the energy and welcoming nature of Glasgow itself. All tours are conducted by myself, Johnny -- so if you have read a good review, you will know that that is the tour that you will be getting! I will provide you with a memorable introduction to this stupendous city, and at the conclusion of the tour, will be delighted to email you as many Glasgow recommendations as you can handle, tailored to your personal interests.\n\nWalk with the self-styled Glasgow Gander around Glasgow City Centre, from Royal Exchange Square to Glasgow Cathedral, taking in the city's famed Victorian architecture, and drinking deeply of its vibrant atmosphere. Learn the fascinating story of Glasgow in the company of a passionate guide. "
            }
        },
        {
            "product_1": {
                "product_code": "144450P2",
                "title": "2 hour group lesson (3-16 people)",
                "description": "2 hour group surfing lesson\n\nAll equipment provided \n\nAn amazing experience to have with your family and friends. "
            }
        },
        {
            "product_2": {
                "product_code": "88768P1",
                "title": "Walking Tours in Inverness City Centre",
                "description": "Take a walk with Cath, a local to the area, and an experienced and qualified tourist guide around her beautiful city of Inverness. A Walk Inverness tour contains lots of local history, beautiful scenery, architecture, and romantic (yet sometimes bloody) tales which have over time, shaped Inverness into the thriving city that stands today.\n\nIn the true spirit of Outlander, find out more about the short but final confrontation of the Jacobite Rising, The Battle of Culloden in 1746, in which the fate of between 1500 Jacobites was sealed by a poor decision and a hostile terrain. Cath will fascinate you with references to Outlander along with life in 18th century Inverness right up to the present day. Sharing stories of clan history, folklore and legends. Step even further back in time to 565 AD and learn about St Columba’s visit to the Highlands.\n"
            }
        },
        {
            "product_3": {
                "product_code": "62330P2",
                "title": "Private 4 Hour Tour of Edinburgh in a Spacious 6-seater Mercedes",
                "description": "During your private 4-Hour Tour soak up the amazing sights of both the Old and New Town of Edinburgh. You will be shown around in a comfortable and spacious vehicle by one of our experienced driver-guides. \n\nThis private tour is perfect for the visitor who has limited time and who wants to see all of the major attractions. You will have time to get out, walk around and take photos and to learn about this beautiful medieval city from your guide. \n\nOr perhaps, you are a visitor who simply wants a shorter tour to orientate yourself to the layout of the city with hints and tips from your guide on the best places to visit, eat and shop in your own time. Here are just some of the places that you will be able to stop at on your tour:\n\nEdinburgh Castle\n\nGrassmarket\n\nGreyfriars Bobby\n\nRoyal Mile\n\nSt Giles Cathedral\n\nMercat Cross\n\nPalace of Holyrood House\n\nArthur's Seat\n\nCalton Hill\n\nWalter Scott Monument\n\nNew Town\n\nDean Village"
            }
        },
        {
            "product_4": {
                "product_code": "196210P1",
                "title": "Award-winning circular cycle tour of Edinburgh! ",
                "description": "This is a cycle tour you won't find anywhere else. I shall take you where other tourists will not know about. There are other cycle tours in Edinburgh, but as I take small groups, you will be able to go at your own pace, ask as many questions as you like and take numerous photos without pressure of being rushed. This tour requires you to be able to cycle for a maximum distance of 20 miles with regular stops and at a slow -steady pace. This tour is not suitable for under 12 years. From Craigmillar Caste, to the stunning Dean Village, Leith and Portobello, you will be cycling through all the 'must-see' parts of Edinburgh that are off the tourist trail. E-bikes can be hired at an additional cost of £15pp cash on the day. Please let me know if you would like this option. (If you think you would prefer a shorter tour, please check out our 'cycle tour to the coast' which is 12 miles, 3 hours)"
            }
        },
        {
            "product_5": {
                "product_code": "144450P1",
                "title": "2 hour private surf lesson! (Up to 2 people)",
                "description": "2 hour private surf lesson\n\nAll equipment provided \n\nThis is for up to two people and will be exclusive to your ability in surfing and what you want to achieve, Wheather that’s just having fun in the water or taking your surfing to the next level."
            }
        },
        {
            "product_6": {
                "product_code": "156576P2",
                "title": "Watch Closely - An Evening of Magic",
                "description": "Glasgow's only dedicated monthly magic show! Hosted by the Scottish \"Close-up Magician of the Year\", this is an enchanting evening of magic, storytelling and unforgettable moments..."
            }
        },
        {
            "product_7": {
                "product_code": "319915P1",
                "title": "Fun Bike Tour in Glasgow",
                "description": "We make locals feel like tourists and tourists feel like locals. \n\nWe are a local tour company specializing in sharing the rich social history of some of the city's most iconic spots. \n\nWe use fully refurbished ex Royal Mail bikes, and all are named after (often not so) famous Glaswegian women and aim to make all our guests appreciate the city as much as we do.\n\nOur routes are safe and take in beautiful parks, rivers and utilize Glasgow's expanding cycle network. If you need an electric bike, please ask us about this as it can often be arranged.\n\nOur tours cover the past and contemporary Glasgow, across themes such as history, architecture, culture, and immigration.\n\n"
            }
        },
        {
            "product_8": {
                "product_code": "40826P3",
                "title": "Private Greyfriars Kirkyard tour - 'Meet' the dead of Old Edinburgh!",
                "description": "The Greyfriars Kirkyard tour is perfect for everyone who wants to know more about Scottish history. The people buried within the Kirkyard made Edinburgh what it was. We'll share some of the most important, most interesting and most surprising stories about these rather fascinating people. And we'll do this in an entertaining, professional and respectful manner. \n\nGreyfriars is a fascinating place that has links to some incredible stories from Scotland’s history (not 'just' Edinburgh's history). Their stories are the stories of Edinburgh. You’ll learn about these characters as you stand only inches away from where their bodies lie buried. \n\nHear the stories behind martyred Covenanters, an amusing artist, an infamous ghost, grave robbers, the Irish murderers Burke and Hare, a tortured spy and, of course, the devoted Skye Terrier, Greyfriars Bobby.\n\nAre you ready to ‘meet’ the ‘Dead of Old Edinburgh’? "
            }
        },
        {
            "product_9": {
                "product_code": "238419P1",
                "title": "Guided Walks in Grantown-on-Spey",
                "description": "The only guided walking tour of Grantown-on-Spey, explaining its history since founded in 1765, the local woods and River Spey. The tour guide is local to the area with extensive knowledge of Scottish history and culture pertaining to the area. Previous experience working in the Highland Archive, written books on the local area and a graduate in Scottish Culture.\nThe tour will commence by the war memorial in the Square and proceed round the town, through the woods to the River Spey. The return to the war memorial will follow a different route by the woods and High St."
            }
        },
        {
            "product_10": {
                "product_code": "235710P7",
                "title": "2000 Years of Scottish History in 1-Hour in Edinburgh",
                "description": "In the true style of the Oral Tradition, Award winning actor Michael Nardone draws on the stories and songs learned at his grandfathers fireside and puts a personal spin on 2000 years of Scottish history, bringing it to life with humour and heartfelt passion. With traditional songs and stories, he captures the magical essence of an ancient land. With a drink of your choice!\n\nHosted in the underground setting of \"The Lost Close,\" underneath the old jail in the heart of the city's famous Royal Mile, this is a truly a unique experience in Edinburgh."
            }
        },
        {
            "product_11": {
                "product_code": "346590P1",
                "title": "Half-day Highlands Bucket List Tour in Scotland ",
                "description": "Half-day highland bucket list Tour from Inverness\n\nOur first stop Clava Cairns is where you will find the standing stones made famous by Diana Gabaldon the author of Outlander. But what else happens at this famous site. Find out with your guide the stories and mysteries of this 4000 year old site.\n\nWe now move on to where in April 1746 on a cold wet moor by the name of Culloden, a battle took place which would change the life of the Highlanders forever. Visit where the gallant Jacobite's took on the might of King George II army.\n\nA trip to the Highlands is never complete without visiting the most famous Loch in the world, Loch Ness. Take your camera just in case Nessie makes an unexpected appearance.\n\nNext lets try some nessie water and taste some Gin and grab a free dram at the award winning Great Glen Distillery.\n\nThey say save the best to last and you will not be disappointed as we stop and visit the most romantic ruin in Scotland, Urquhart castle. Explore 1000 years of history.\n\n"
            }
        },
        {
            "product_12": {
                "product_code": "126374P1",
                "title": "Gin school 'make your own bottle' experience.",
                "description": "What makes this experience unique is the fact that it is a very hands on, bespoke, personal and very knowledgeable workshop. Where you learn of the workings of a micro distillery, get to taste different spirit profiles, you also get to design and make your very own bottle of gin to take home with you after the class."
            }
        },
        {
            "product_13": {
                "product_code": "235710P8",
                "title": "Witch-Women on Trial",
                "description": "The true story of the Witches. Humour and horror are woven together with empathy in a shocking insight into the untold stories of ordinary women caught up in a whirlwind of politics, religion, and magic. Be prepared to laugh, and cry, at the injustices served through their stories.\n\n60 minutes of dark history, hosted underground beneath the old courthouse."
            }
        },
        {
            "product_14": {
                "product_code": "122366P2",
                "title": "Braveheart (Battle of Stirling Bridge) Tour",
                "description": "Freedom Tour Today was set up by my dog Molly, and me to welcome visitors to Stirling. And to give a warm hug and say thank you for taking the time to remember our great heroes who fought, died, and survived at the Battle of Stirling Bridge. \n\nIt has always amazed me the number of tourists that had never heard of Wallace's greatest victory at Stirling Bridge (It wasn't in Braveheart). Walk in the footsteps of William Wallace and young Andrew De Moray and relive the Battle on the site where it took place. We shall discuss the build-up, the main characters involved in the battle as well as present-day initiatives aiming to commemorate the importance of the Battle of Stirling Bridge. \n\nWe also do a tour of Bannockburn Battlefield, the scene of Robert the Bruce’s greatest victory. \n\nFreedom Tour Today is the perfect way for Molly & me to welcome visitors to the area and learn more about why so many people hold these historic sites and Scotland dear to their hearts. Thank you."
            }
        },
        {
            "product_15": {
                "product_code": "311671P1",
                "title": "Harry Potter and Horrible Histories Walking Tour in Edinburgh",
                "description": "This is a unique walking tour which combines Harry Potter, History and Scottish Cuisine into one, all the while making you laugh. \n\nThis experience is fun, interactive and educational where we will learn about J K Rowling’s life, delve deep into Edinburgh's dark history, including executions and grave robbers, hear the tale of Edinburgh's most loved dog, walk in the footsteps of Charles Darwin and finish off indulging in Scottish delicacies like haggis and deep fried mars bar?"
            }
        },
        {
            "product_16": {
                "product_code": "122366P1",
                "title": "Bannockburn Battlefield Tour (Outdoor Tour operated by Freedom Tour Today)",
                "description": "My dog Molly and I were amazed at the number of tourists who arrived at the Battlefield, spent less than 10 minutes at the site of Scotland's greatest battle, then departed Bannockburn. We felt the story of the battle, why it was fought and how the Scots were victorious deserved to be told. \n\nSo we set up Freedom Tour Today to give visitors a warm welcome, a hug, and a thank you for taking the time to remember Robert the Bruce, James Douglas, and all those who fought, died, and survived at Bannockburn. \n\nOur outdoor tour on the Battlefield, covers the Wars of Independence, the Battle in 1314, and the aftermath up to the current day. We shall entertain you with stories of the main characters and the small folk who influenced the battle. \n\nWe also do a Stirling Bridge tour, the scene of William Wallace’s greatest victory. Freedom Tour Today is the perfect way for us to welcome visitors and learn more about why so many people hold these historic sites and Scotland dear to their hearts. "
            }
        },
        {
            "product_17": {
                "product_code": "7531P2",
                "title": "White Water Rafting Half-Day Trip on the River Tummel",
                "description": "This popular activity runs from June to October and is a half day rafting trip on the River Tummel. This half-day rafting experience is suitable for those aged 16 and above. The day is guaranteed to be both exhilarating and adventurous.\n\nRafting on the River Tummel offers an unforgettable experience in one of Scotland’s most scenic countryside. You can enjoy the thrill of navigating rapids, while also basking in the stunning natural beauty around the Clunie and Loch Faskally area of Perthshire. A haven for visiting walkers and cyclists alike who enjoy the trails in this area."
            }
        },
        {
            "product_18": {
                "product_code": "170973P1",
                "title": "Wildlife Watching Safari by Vehicle & Walks / Photography workshops with a Guide",
                "description": " Reviews :Stewart is incredibly knowledgeable. He has an almost uncanny way of finding wildlife - probably due to his understanding of the habits and habitats of all the wildlife around. His passions shines through and he is happy to share this with others. Added to that his wife is an amazing cook so enjoy the picnic!\n\nMatt Rivers \n5 star\nMay 1, 2018 · \n\nCracking day out with Stewart and highly recommend his services, great fun, never seen Golden Eagles in the wild before, even if it was a brief glimpse of them a couple of hundred feet above our head, but that’s nature, can’t tell it when and where to be on request. Also got to see a mother and pup Sea Otter catching and eating a Conger eel amongst lots of other wildlife and then to top the day off got to see a couple of different Pine Martins so all in all a very rewarding day out! (Home made cakes and pasties for lunch was an added bonus) \n"
            }
        },
        {
            "product_19": {
                "product_code": "246096P1",
                "title": "Edinburgh - Old Town Stories",
                "description": "The perfect introduction to the city.\n\nYour guide will lead you through Old Town Edinburgh, where you'll be introduced not only to the most famous landmarks, but also to some of the hidden gems that make our beloved city so special.\n\nYou'll learn about the origins of Scotland and Edinburgh, hear the stories of our illustrious citizens and (in)famous residents, wander among graves and through cobbled streets, always in the company of a knowledgeable and personable guide.\n\nNot to be missed!"
            }
        },
        {
            "product_20": {
                "product_code": "207623P11",
                "title": " HALF DAY TOUR: loch Ness, Coo's, Whisky, Battlefields & Stones,from INVERNESS ",
                "description": "HISTORIC AND SCENIC TOURS .\n Whether you are looking for half day or full day tours from Inverness or simply trying to take in as many of the beautiful sights as possible on your Highland adventure, our Loch Ness tour from Inverness is sure to captivate like no other. Our friendly guide will pick you up from your hotel or AT 7 NESS WALK , IN FRONT OF THE COLUMBA HOTEL and take you on a tour to remember around some of the most famous, historic and culturally significant sites anywhere in Scotland.\nFrom Inverness we will travel to Loch Ness, home of the romantic and brooding Urquhart Castle (as well as a certain legendary monster!) The tour then turns towards the historic Beauly Priory, Then on to the historic and dramatic Culloden Battlefield and Clava Cairns, Round off your tour in Inverness with St. Andrew’s Cathedral and Ness Islands, before being dropped off at the Columba hotel . What are you waiting for ? Book our Loch Ness tour from Inverness and experience the Highlands .\n"
            }
        },
        {
            "product_21": {
                "product_code": "330008P1",
                "title": "Fun, Flexible Treasure Hunt Around Edinburgh with Cryptic Clues & Hidden Gems",
                "description": "A fun and different way to see Edinburgh. Solve satisfying clues and follow beautiful maps sent to your phones. Spot things other people take for granted!\n\nYou’ll learn interesting facts and stories. Everything is outdoors and you can do social distancing."
            }
        },
        {
            "product_22": {
                "product_code": "321040P1",
                "title": " Food Walking Guided Tour of Perth",
                "description": "This is the only food walking tour in Perth, Scotland. Tour guests get to spend time with a local person and discover Perth in a unique way. During the tour they will be taken on a gentle walk around the city of Perth and learn a little of our local history and some fun facts. They will also stop at up to 7 venues to sample local delicacies and traditional Scottish food and drinks which will be the equivalent of a light 3 course lunch.\nThis tour has been specially created by us and is a really fun and interesting way to spend an afternoon, learn more about the city of Perth and maybe even make some new friends!"
            }
        },
        {
            "product_23": {
                "product_code": "6705STIR",
                "title": "Stirling Whisky Distillery and St Andrews Day Trip from Edinburgh",
                "description": "Visit the medieval city of Stirling, historical St Andrews and a whisky distillery on this comprehensive day trip from Edinburgh. With an expert guide at your side, depart from Edinburgh by coach or minivan and journey to Stirling, home to the famous medieval citadel. Learn about the art of making whisky at a distillery. Then, head to the coastal town of St Andrews, the birthplace of golf. On the way back to Edinburgh, stop to take photos of the Victorian landmark Forth Bridge. Entrance fees not included."
            }
        },
        {
            "product_24": {
                "product_code": "40826P6",
                "title": "Private Royal Mile walking tour - Discover the history of our most famous street",
                "description": "Explore the oldest parts of Edinburgh's UNESCO World Heritage Site with an award-winning, five-star rated local guide! Robert was born within sight of the Old Town. He has lived in Edinburgh all his life and even went to a university on the Royal Mile! He teaches in a local primary school. Robert will wear traditional Scottish attire for your tour. We don't think you can get much more local flavour than this!"
            }
        },
        {
            "product_25": {
                "product_code": "130291P1",
                "title": "Private St Andrews and Kingdom of Fife Luxury Day Trip ",
                "description": "We specialise in creating Scottish adventures for individuals. \n\nAs our tours are personally tailored to your interests, you will leave with a feeling of satisfaction knowing that you've seen what you wanted, how you wanted.\n\nHailed as “miniature Scotland”, the ancient Kingdom of Fife is a must for avid wanderlusters longing for outstanding Scottish culture - in just a day! \n\nEnjoy, relax and just switch off. Get to know the country and its people, immerse yourself in nature and tradition. At TRIPorganiser Scotland we know where to find something special. Trust us with your with valuable travel time. Authenticity is our top priority.\n"
            }
        },
        {
            "product_26": {
                "product_code": "102058P1",
                "title": "Bruar Canyoning Experience ",
                "description": "Bruar is a very special place for canyoning in Scotland. It has exquisite waterfalls and rock features surrounded by beautiful pine forests. This canyoning experience has everything to offer; awesome jumps ranging from 2 meters to 10 meters, water flumes, vertical rock slides and awesome waterfall abseils/rappels. Bruar Canyon is non stop fun, with something for everyone! That’s a promise. \n\nWe only operate small groups for maximum experience and time with our instructors. \n\nWhat's included: \n • 1.5 - 2 hours of pure canyoning adventure.  \n • High quality canyoning 5mm wetsuits, equipment and shoes. \n • Two highly experience and certified ICOpro Instructors.  \n • Free photos/video. \n • Tuition and certification. \n • Snacks and drinks. \n • An adventure of a lifetime  "
            }
        },
        {
            "product_27": {
                "product_code": "183324P1",
                "title": "Inverness Bike Tour a 2 hours guided bike tour around the Waterways of Inverness",
                "description": "This tour is very Scenic visiting areas of Inverness you won’t see on foot or public transport or driving. The Waterways Tour rides along the River Ness and The Caledonian Canal with many stops to learn about the area. A local guide who has lived in Inverness all their life will share history and local events with you. We use easy to ride cruiser bikes on a flat route just over 6 miles. This is adults only tour (teenagers and above)."
            }
        }
    ]
}