[
    {
        "productCode": "100972P3",
        "title": "Parisian Life Style Private Photo Shoot at Eiffel Tower",
        "description": "Visiting Paris? \n\nTime to live the dream! \n\nWalk around the city with a local professional photographer and take home the best images of your amazing trip. In a 100% Parisian life style photo shooting, get to know Paris' highlights and secrets and keep your memories forever. \n • 1h photo shooting with local professional photographer \n • 50-80 high resolution EDITED photos sent by mail after the shooting \n • groups up to ten people! \n • Ideal for celebrating your honeymoon, engagement photos, bachelor party, family trip, birthdays and more \n • props included for kids \n • kids friendly activity \n • fun, local and 100% passionate photographers!\n\nNOTE: you will be booked in the first available hour. You will receive an email about your tour hour, meeting point and recognizing your photographer within 7 days of booking. Please check your spam and contact with us if you have not received it. ",
        "productUrl": "https://shop.live.rc.viator.com/tours/Paris/EIFFEL-TOWER-TROCADERO-1h-Photo-Shooting/d479-100972P3?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/09/21/f3/64.jpg"
    },
    {
        "productCode": "44598P8",
        "title": "Paris in a Day - Private Experience",
        "description": "Explore the atmospheric neighborhoods of Paris like a local on this private custom-made tour that cleverly combines pleasurable walking moments into the historic neighborhoods with the use of private (taxi) and public (metro/bus) transportation when needed. Accompanied by your guide, enjoy walking Latin Quarter and other typical Parisian neighborhoods praised by the locals, admire landmarks like Notre-Dame, Arc de Triomphe, Louvre, Pantheon, Invalides. Discover Paris neighborhoods where you'll stroll the Luxembourg Gardens and lesser known highlights on the way. Get to navigate like a true Parisian and learn to easily and safely use Paris Metro. Receive tips on what to see and do in Paris from a local guide. Private tour ensures a completely customized experience Hassle-free pickup and drop-off at your hotel within Paris city limits. NO pick up at hotels near Paris airports (CDG, Orly, Beauvais). It's like going with your friend who knows a lot about it and wants to share it with you.",
        "productUrl": "https://shop.live.rc.viator.com/tours/Paris/Paris-in-a-Day-Private-Experience/d479-44598P8?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/06/6c/59/31.jpg"
    },
    {
        "productCode": "7251P11",
        "title": "The Paris Monuments Tour",
        "description": "The Paris Monuments bike tour is focused exclusively on Paris' legendary sites & attractions. You’ll see everything you have on your list, from the Notre Dame to the Eiffel Tower. You’ll cover more ground than you thought possible, experience Paris’ new and best bike lanes, and learn the history of some of the most adored museums and landmarks in the world. Our guides are well trained in Paris history, and more importantly, how to get you to each stop safely - all while gliding gleefully along!",
        "productUrl": "https://shop.live.rc.viator.com/tours/Paris/The-Paris-Monuments-Tour/d479-7251P11?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://hare-media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0a/5d/02/e3.jpg"
    }
]