[
    {
        "productCode": "317366P1",
        "title": "Arad City Private Walking Tour",
        "description": "Arad was once in the middle of the Austrian – Hungarian Monarchy. Germans, Hungarians, Romanians, Serbs, and Jews have lived here peacefully over the centuries and built together a culture that is hard to imagine anywhere else! \nWe will talk about the golden age dating back to the beginning of the 20th century when most of the buildings we admire today were built. We will explore the multiculturality of the city through the stories about those who inhabited it and we will learn about heroes undressed by their uniforms in the Romanian – Hungarian Reconciliation Park! History, architecture and the stories of those who walked this way and lived over the centuries in a fascinating environment!\n",
        "productUrl": "https://www.viator.com/tours/Arad/Arad-City-Tour/d25907-317366P1?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0b/ed/cb/7b.jpg",
        "duration": 180,
        "lengthType": "Part Day",
        "rating": 5.0,
        "price": 74.17,
        "availableOnDate": [
            "Nothing Found",
            "Nothing Found"
        ]
    },
    {
        "productCode": "268155P68",
        "title": "Arad to Bucharest - Private Guided Transfer - Car and Driver",
        "description": "Just let us know the time and the place from where we should pick you up!\n\nOUR SERVICE GUARANTEES:\n• Discretion \n• Useful tips and information regarding any activities you have planned \n• Flexibility \n\nIt should not surprise you that with us you get a private driver whose only purpose is to make your trip memorable, in a positive way :)",
        "productUrl": "https://www.viator.com/tours/Arad/Private-Guided-Transfer-from-Arad-to-Bucharest/d25907-268155P68?mcid=42383&pid=P00111704&medium=api&api_version=2.0",
        "imageUrl": "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-240x160/0a/e4/59/da.jpg",
        "duration": 480,
        "lengthType": "Full Day",
        "rating": 5.0,
        "price": 433.62,
        "availableOnDate": [
            "Nothing Found",
            "Nothing Found"
        ]
    }
]